Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/sys_reg.h
#define SYS_CPU_26M_WDT_CLK_DIV_CKSEL_QSPI1_POS (8)
#define SYS_CPU_26M_WDT_CLK_DIV_CKSEL_QSPI1_MASK (0x3)

#define SYS_CPU_26M_WDT_CLK_DIV_RESERVED_10_31_POS (10)
#define SYS_CPU_26M_WDT_CLK_DIV_RESERVED_10_31_MASK (0x3fffff)

#define SYS_CPU_ANASPI_FREQ_ADDR (SOC_SYSTEM_REG_BASE + (0xb << 2))

#define SYS_CPU_ANASPI_FREQ_ANASPI_FREQ_POS (0)
#define SYS_CPU_ANASPI_FREQ_ANASPI_FREQ_MASK (0x3f)

#define SYS_CPU_ANASPI_FREQ_RESERVED_6_31_POS (6)
#define SYS_CPU_ANASPI_FREQ_RESERVED_6_31_MASK (0x3ffffff)

#define SYS_CPU_DEVICE_CLK_ENABLE_ADDR (SOC_SYSTEM_REG_BASE + (0xc << 2))

#define SYS_CPU_DEVICE_CLK_ENABLE_I2C0_CKEN_POS (0)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2C0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI0_CKEN_POS (1)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART0_CKEN_POS (2)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PWM0_CKEN_POS (3)
#define SYS_CPU_DEVICE_CLK_ENABLE_PWM0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM0_CKEN_POS (4)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SADC_CKEN_POS (5)
#define SYS_CPU_DEVICE_CLK_ENABLE_SADC_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART3_CKEN_POS (6)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART3_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_GPIO_CKEN_POS (7)
#define SYS_CPU_DEVICE_CLK_ENABLE_GPIO_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2C1_CKEN_POS (8)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2C1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_POS (9)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_POS (10)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_POS (11)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_12_12_POS (12)
#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_12_12_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_POS (13)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_14_14_POS (14)
#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_14_14_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_POS (15)
#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S_CKEN_POS (16)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_LED_CKEN_POS (17)
#define SYS_CPU_DEVICE_CLK_ENABLE_LED_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_18_19_POS (18)
#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_18_19_MASK (0x3)

#define SYS_CPU_DEVICE_CLK_ENABLE_DPLLDIV_CKEN_POS (20)
#define SYS_CPU_DEVICE_CLK_ENABLE_DPLLDIV_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI1_CKEN_POS (21)
#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SDIO_CKEN_POS (22)
#define SYS_CPU_DEVICE_CLK_ENABLE_SDIO_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_AUXS_CKEN_POS (23)
#define SYS_CPU_DEVICE_CLK_ENABLE_AUXS_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_BTDM_CKEN_POS (24)
#define SYS_CPU_DEVICE_CLK_ENABLE_BTDM_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_XVR_CKEN_POS (25)
#define SYS_CPU_DEVICE_CLK_ENABLE_XVR_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_MAC_CKEN_POS (26)
#define SYS_CPU_DEVICE_CLK_ENABLE_MAC_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PHY_CKEN_POS (27)
#define SYS_CPU_DEVICE_CLK_ENABLE_PHY_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_THREAD_CKEN_POS (28)
#define SYS_CPU_DEVICE_CLK_ENABLE_THREAD_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_RF_CKEN_POS (29)
#define SYS_CPU_DEVICE_CLK_ENABLE_RF_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_30_30_POS (30)
#define SYS_CPU_DEVICE_CLK_ENABLE_RESERVED_BIT_30_30_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_WDT_CKEN_POS (31)
#define SYS_CPU_DEVICE_CLK_ENABLE_WDT_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ADDR (SOC_SYSTEM_REG_BASE + (0xf << 2))

#define SYS_CPU_DEVICE_MEM_CTRL2_UART1_DS_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_UART2_DS_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART2_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SPI1_DS_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL2_SPI1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SDIO_DS_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL2_SDIO_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_UART3_DS_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART3_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_LED_DS_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL2_LED_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED_6_6_POS (6)
#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED_6_6_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI1_DS_POS (7)
#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_PRAM_DS_POS (8)
#define SYS_CPU_DEVICE_MEM_CTRL2_PRAM_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED0_POS (9)
#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED0_MASK (0x7)

#define SYS_CPU_DEVICE_MEM_CTRL2_I2S0_DS_POS (12)
#define SYS_CPU_DEVICE_MEM_CTRL2_I2S0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED_13_20_POS (13)
#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED_13_20_MASK (0xff)

#define SYS_CPU_DEVICE_MEM_CTRL2_MAC_DS_POS (21)
#define SYS_CPU_DEVICE_MEM_CTRL2_MAC_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_PHY_DS_POS (22)
#define SYS_CPU_DEVICE_MEM_CTRL2_PHY_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_XVR_DS_POS (23)
#define SYS_CPU_DEVICE_MEM_CTRL2_XVR_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED_BIT_24_24_POS (24)
#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED_BIT_24_24_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_LA_DS_POS (25)
#define SYS_CPU_DEVICE_MEM_CTRL2_LA_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_FLSH_DS_POS (26)
#define SYS_CPU_DEVICE_MEM_CTRL2_FLSH_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_UART_DS_POS (27)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART_DS_MASK (0x1)

