Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/sys_reg.h
#define SYS_CPU0_INT_32_63_STATUS_CPU0_QSPI1_INT_ST_POS (10)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_QSPI1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV8_INT_ST_POS (11)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV8_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV9_INT_ST_POS (12)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV9_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV10_INT_ST_POS (13)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV10_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV11_INT_ST_POS (14)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV11_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV12_INT_ST_POS (15)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV12_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_THREAD_INT_ST_POS (16)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_THREAD_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV13_INT_ST_POS (17)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV13_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_OTP_INT_ST_POS (18)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_OTP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLLUNLOCK_INT_ST_POS (19)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLLUNLOCK_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV14_INT_ST_POS (20)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV14_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV15_INT_ST_POS (21)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV15_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV16_INT_ST_POS (22)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV16_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_S_INT_ST_POS (23)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_S_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_NS_INT_ST_POS (24)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_NS_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_ANA3V_WAKEUP_INT_ST_POS (25)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_ANA3V_WAKEUP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV26_POS (26)
#define SYS_CPU0_INT_32_63_STATUS_RESV26_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV27_POS (27)
#define SYS_CPU0_INT_32_63_STATUS_RESV27_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV28_POS (28)
#define SYS_CPU0_INT_32_63_STATUS_RESV28_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV29_POS (29)
#define SYS_CPU0_INT_32_63_STATUS_RESV29_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV30_POS (30)
#define SYS_CPU0_INT_32_63_STATUS_RESV30_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV31_POS (31)
#define SYS_CPU0_INT_32_63_STATUS_RESV31_MASK (0x1)

#define SYS_GPIO_CONFIG0_ADDR (SOC_SYSTEM_REG_BASE + (0x30 << 2))

#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_POS (0)
#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_MASK (0xffffffff)

#define SYS_GPIO_CONFIG1_ADDR (SOC_SYSTEM_REG_BASE + (0x31 << 2))

#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_POS (0)
#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_MASK (0xffffffff)

#define SYS_GPIO_CONFIG2_ADDR (SOC_SYSTEM_REG_BASE + (0x32 << 2))

#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_POS (0)
#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_MASK (0xffffffff)

//TODO 
#define SYS_SYS_DEBUG_CONFIG1_ADDR (0)
#define SYS_SYS_DEBUG_CONFIG0_ADDR (SOC_SYSTEM_REG_BASE + (0x38 << 2))

#define SYS_DBUG_CONFIG0_ADDR (SOC_SYSTEM_REG_BASE + (0x38 << 2))

#define SYS_DBUG_CONFIG0_DBUG_MSG_POS (0)
#define SYS_DBUG_CONFIG0_DBUG_MSG_MASK (0xffff)

#define SYS_DBUG_CONFIG0_DBUG_MUX_POS (16)
#define SYS_DBUG_CONFIG0_DBUG_MUX_MASK (0xf)

#define SYS_DBUG_CONFIG0_RESERVED_20_31_POS (20)
#define SYS_DBUG_CONFIG0_RESERVED_20_31_MASK (0xfff)

#define SYS_ANAREG_STAT_ADDR (SOC_SYSTEM_REG_BASE + (0x3a << 2))

#define SYS_ANAREG_STAT_ANAREG_STAT_POS (0)
#define SYS_ANAREG_STAT_ANAREG_STAT_MASK (0xffffffff)

#ifdef __cplusplus
}
#endif
